###
# 给你一个整数 n ，请你在无限的整数序列 [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, ...] 中找出并返回第 n 位上的数字。
#
# 要求的是第n位数字，只要找出第n位属于哪个数字的第几位。先找出所属数字是几位数，再找出是这个数字的哪一位。
class Solution:
    def findNthDigit(self, n: int) -> int:
        # 9, 90, 900, 9000...
        # 9, 90*2, 900*3, 9000*4 ...
        # n = 500, 90*2+9<n<=90*2+9+900*3, 3位数里面第500-90*2-9=311位
        # 第103个数字202后第2个数字，也就是203的第2个数字
        m = 0
        pre = 0
        while n > (pre + 9 * (10 ** m) * (m + 1)):
            pre += 9 * (10 ** m) * (m + 1)
            m += 1
        t = n - pre
        # 求m+1位数里面的第t位数，
        num = (t - 1) // (m + 1) + 10 ** (m)
        return int(str(num)[(t - 1) % (m + 1)])
